In [ ]:
it is a popular data analysis library of python
it is based upon numpy array
it provides a large volume of functionality to perform data preprocessing
why not excel? ---> excel cant deal with large volume of data
pandas is a 3rd party package  availabel on anaconda
 pip install pandas

In [ ]:
series ---> it refers to a column in a data frame

In [3]:
import pandas as pd
s=pd.Series([10,20,30,40]) 
s

0    10
1    20
2    30
3    40
dtype: int64

In [4]:
type(s)

pandas.core.series.Series

In [5]:
print(s)

0    10
1    20
2    30
3    40
dtype: int64

In [6]:
s.dtype

dtype('int64')

In [7]:
import pandas as pd
s2=pd.Series({1:10,2:20,3:30})
s2

1    10
2    20
3    30
dtype: int64

In [8]:
s3=pd.Series([10,20,30,40],index=['a','b','c','d']) 
s3

a    10
b    20
c    30
d    40
dtype: int64

In [ ]:
# how to access ??
indexing and slicing

In [9]:
s3['a']

10

In [10]:
s3[::-1]

d    40
c    30
b    20
a    10
dtype: int64

In [11]:
#add 2 series
s2+s3

1   NaN
2   NaN
3   NaN
a   NaN
b   NaN
c   NaN
d   NaN
dtype: float64

In [12]:
s=pd.Series([10,20,30,40]) 
r=pd.Series([1,2,3,4]) 
s+r

0    11
1    22
2    33
3    44
dtype: int64

# DATA FRAME

In [ ]:
# Data Frame
row and column arrangement of data is called as data frame

In [13]:
df=pd.DataFrame([10,20,30,40,50])
df

    0
0  10
1  20
2  30
3  40
4  50

In [14]:
df=pd.DataFrame([[10,20,30],[40,50,60],[90,70,80]])
df

    0   1   2
0  10  20  30
1  40  50  60
2  90  70  80

In [15]:
df=pd.DataFrame([[10,20,30],[40,50,60],[90,70,80]],columns=[1,2,3])
df

    1   2   3
0  10  20  30
1  40  50  60
2  90  70  80

In [19]:
df=pd.DataFrame([[10,20,30],[40,50,60],[90,70,80]],rows=['a','b','c'],columns=[1,2,3])
df

TypeError: DataFrame.__init__() got an unexpected keyword argument 'rows'

In [22]:
s3['a']# series

10

In [23]:
df[[1]]

    1
0  10
1  40
2  90

In [25]:
df2=pd.DataFrame({'roll':[1,2,3,4],'name':['sweta','rani',
                                          'snidi','pristy'],'age':[20,21,22,23]})
df2

   roll    name  age
0     1   sweta   20
1     2    rani   21
2     3   snidi   22
3     4  pristy   23

In [26]:
df2[['roll','age']]

   roll  age
0     1   20
1     2   21
2     3   22
3     4   23

# CSV File

In [ ]:
how to acess csv file
use read_csv()(method)

In [27]:
ddf=pd.read_csv("C:\\Users\\Sweta\\Desktop\\python\\student.csv")
ddf

   roll    name  age   city  mark
0   101  ranjan   18   bbsr    90
1   102    kris   19    ctc    80
2   103   sweta   20    knk    95
3   104    rani   21  delhi    85
4   105   sidhi   26    chn    76

In [28]:
ddf[['roll','city']]

   roll   city
0   101   bbsr
1   102    ctc
2   103    knk
3   104  delhi
4   105    chn

In [30]:
ddf['age'].max()

26

In [31]:
ddf['age'].mean()

20.8

In [ ]:
# some imp parameters of read_csv 
nrows ---- display specific no of rows

In [32]:
d2f=pd.read_csv("C:\\Users\\Sweta\\Desktop\\python\\student.csv",nrows=2)
d2f

   roll    name  age  city  mark
0   101  ranjan   18  bbsr    90
1   102    kris   19   ctc    80

In [33]:
#usecols --- > display specific selected columns
d3f=pd.read_csv("C:\\Users\\Sweta\\Desktop\\python\\student.csv",usecols=[0,2])
d3f

   roll  age
0   101   18
1   102   19
2   103   20
3   104   21
4   105   26

In [35]:
d4f=pd.read_csv("C:\\Users\\Sweta\\Desktop\\python\\student.csv",nrows=2,usecols=[0,2])
d4f

   roll  age
0   101   18
1   102   19

In [ ]:
skiprows--- skip some specific rows

In [36]:
d5f=pd.read_csv("C:\\Users\\Sweta\\Desktop\\python\\student.csv",skiprows=1)
d5f

   101 ranjan  18   bbsr  90
0  102   kris  19    ctc  80
1  103  sweta  20    knk  95
2  104   rani  21  delhi  85
3  105  sidhi  26    chn  76

In [37]:
d5f=pd.read_csv("C:\\Users\\Sweta\\Desktop\\python\\student.csv",skiprows=[2,4])
d5f

   roll    name  age  city  mark
0   101  ranjan   18  bbsr    90
1   103   sweta   20   knk    95
2   105   sidhi   26   chn    76

# header ----> gives heading

In [38]:
d6f=pd.read_csv("C:\\Users\\Sweta\\Desktop\\python\\student1.csv",header=None)
d6f

     0       1   2     3   4
0  101  ranjan  18  bbsr  90
1  102   krisa  19   ctc  80
2  103   kunal  20   knk  95

In [40]:
d6f=pd.read_csv("C:\\Users\\Sweta\\Desktop\\python\\student2.csv",header=1)
d6f

   roll    name  age
0   101  dinesh   23
1   103  saurav   25
2   105   rahul   26

In [ ]:
how to assign column names to a data frame

In [44]:
d7f=pd.read_csv("C:\\Users\\Sweta\\Desktop\\python\\student1.csv",names=['roll','name','age','city','mark'])
d7f

   roll    name  age  city  mark
0   101  ranjan   18  bbsr    90
1   102   krisa   19   ctc    80
2   103   kunal   20   knk    95

In [3]:
#how to make specific column as index
import pandas as pd
d8f=pd.read_csv("C:\\Users\\Sweta\\Desktop\\python\\student1.csv",names=['roll','name','age','city','mark'],index_col='roll')
d8f

        name  age  city  mark
roll
101   ranjan   18  bbsr    90
102    krisa   19   ctc    80
103    kunal   20   knk    95

In [4]:
# how to add a new column to data frame
d=pd.DataFrame({'roll':[101,102,104,106],'age':[20,22,24,25]})
d

   roll  age
0   101   20
1   102   22
2   104   24
3   106   25

In [5]:
d['mark']=[70,80,90,100]
d

   roll  age  mark
0   101   20    70
1   102   22    80
2   104   24    90
3   106   25   100

In [6]:
# how to add a new row
d.loc[4]=[108,27,85]
d

   roll  age  mark
0   101   20    70
1   102   22    80
2   104   24    90
3   106   25   100
4   108   27    85

In [8]:
d.drop(columns=['age'])

   roll  mark
0   101    70
1   102    80
2   104    90
3   106   100
4   108    85

In [9]:
d.drop(['roll'],axis=1) # axis =0 (row), axis=1 (column)

   age  mark
0   20    70
1   22    80
2   24    90
3   25   100
4   27    85

In [10]:
# how to remove specific rows
d.drop([0,2])

   roll  age  mark
1   102   22    80
3   106   25   100
4   108   27    85

In [13]:
d.drop([0,2],axis=0)

   roll  age  mark
1   102   22    80
3   106   25   100
4   108   27    85

In [15]:
# how to access a specific item
d['age'][0]

20

In [17]:
d.loc[0]['age']

20

In [19]:
d['age'][0]=18

In [20]:
d

   roll  age  mark
0   101   18    70
1   102   22    80
2   104   24    90
3   106   25   100
4   108   27    85

In [21]:
d.replace({'roll':101},100)

   roll  age  mark
0   100   18    70
1   102   22    80
2   104   24    90
3   106   25   100
4   108   27    85

In [23]:
#how to rename a column
d['age'][3]=30

In [24]:
d

   roll  age  mark
0   101   18    70
1   102   22    80
2   104   24    90
3   106   30   100
4   108   27    85

# How to handle missing values in a dataframe

In [ ]:
During collecting data there may be a chance that some of datas 
are not collected these are called as missing values

normally when we load a csv file in program most of missing values 
automatically convert int Nan()

In [25]:
import pandas as pd
a=pd.read_csv("tri.csv")
a

     name   age  roll  grp
0   sweta  20.0    44  2.0
1   swati  21.0    43  2.0
2  bhakti  22.0    10  1.0
3     asi   NaN    15  NaN

In [ ]:
# following values also will be converted to nan automatically when we load that file

N/A
n/a
nan
NULL
null

In [26]:
# let's create a csv file and see how to handle unwanted string in data frame
b=pd.read_csv("tri2.csv")
b

     name   age      eid            grp
0   sweta    20       44              2
1   swati    21       43              2
2  bhakti    22       10              1
3     asi    15  missing  not availabel

In [27]:
b=pd.read_csv("tri2.csv",na_values=["missing","not availabel"])
b

     name   age   eid  grp
0   sweta    20  44.0  2.0
1   swati    21  43.0  2.0
2  bhakti    22  10.0  1.0
3     asi    15   NaN  NaN

In [28]:
# how to count the missing values isnull()/isnal()
b.isnull().sum()

name    0
 age    0
eid     1
grp     1
dtype: int64

In [29]:
b.isnull().sum().sum()# total NaN values

2

In [ ]:
dropna() ----- this method will remove rows or columns with NaN values

In [1]:
import pandas as pd
import numpy as np
df=pd.DataFrame({'roll':[101,np.nan,105,np.nan,108],
                 'name':['sachin','saurav',np.nan,'dines',np.nan],
                 'age':[20,21,np.nan,np.nan,30],
                'city':['bbsr','ctc','puri',np.nan,'jajpur']})
df

    roll    name   age    city
0  101.0  sachin  20.0    bbsr
1    NaN  saurav  21.0     ctc
2  105.0     NaN   NaN    puri
3    NaN   dines   NaN     NaN
4  108.0     NaN  30.0  jajpur

In [2]:
df.dropna() # drop all rows with  atleast 1 nan values

    roll    name   age  city
0  101.0  sachin  20.0  bbsr

# parameters dropna()
axis ,
how ,
thresh ,
subset ,
inplace ,
method ,
limit ,

In [ ]:
# axis=0/1
axis =0 refers to row and 1 refers to column

In [3]:
df.dropna(axis=1) # delete all columns with atleast 1 nan values

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

In [ ]:
how = any/all
how = any --- it will drop all the row /column with atleast one nan
how=all ---   it will drop  the row /column which have all values are nan

In [4]:
df.dropna(axis=0,how='any')

    roll    name   age  city
0  101.0  sachin  20.0  bbsr

In [5]:
df.dropna(axis=0,how='all')

    roll    name   age    city
0  101.0  sachin  20.0    bbsr
1    NaN  saurav  21.0     ctc
2  105.0     NaN   NaN    puri
3    NaN   dines   NaN     NaN
4  108.0     NaN  30.0  jajpur

In [6]:
df['mark']=[np.nan,np.nan,np.nan,np.nan,np.nan]
df

    roll    name   age    city  mark
0  101.0  sachin  20.0    bbsr   NaN
1    NaN  saurav  21.0     ctc   NaN
2  105.0     NaN   NaN    puri   NaN
3    NaN   dines   NaN     NaN   NaN
4  108.0     NaN  30.0  jajpur   NaN

In [7]:
df.dropna(axis=1,how='all')

    roll    name   age    city
0  101.0  sachin  20.0    bbsr
1    NaN  saurav  21.0     ctc
2  105.0     NaN   NaN    puri
3    NaN   dines   NaN     NaN
4  108.0     NaN  30.0  jajpur

In [ ]:
# thresh ---- it will display  those rows or columns with atleast n no of not null values

In [8]:
df.dropna(thresh=3) #default axis =0

    roll    name   age    city  mark
0  101.0  sachin  20.0    bbsr   NaN
1    NaN  saurav  21.0     ctc   NaN
4  108.0     NaN  30.0  jajpur   NaN

In [ ]:
# subset it will drop those rows where name column contains nan

In [9]:
df.dropna(subset=['name'])

    roll    name   age  city  mark
0  101.0  sachin  20.0  bbsr   NaN
1    NaN  saurav  21.0   ctc   NaN
3    NaN   dines   NaN   NaN   NaN

In [10]:
df.dropna(subset=['name','age'])

    roll    name   age  city  mark
0  101.0  sachin  20.0  bbsr   NaN
1    NaN  saurav  21.0   ctc   NaN

In [ ]:
inplace=True/False(default is false)

In [11]:
df.dropna(subset=['name'],inplace=True) # if you use inplace originial dataframe will be chnaged

In [12]:
df

    roll    name   age  city  mark
0  101.0  sachin  20.0  bbsr   NaN
1    NaN  saurav  21.0   ctc   NaN
3    NaN   dines   NaN   NaN   NaN

In [ ]:
fillna() --- fill the nan values by some other values

In [13]:
import pandas as pd
import numpy as np
df=pd.DataFrame({'roll':[101,np.nan,105,np.nan,108],
                 'name':['sachin','saurav',np.nan,'dines',np.nan],
                 'age':[20,21,np.nan,np.nan,30],
                'city':['bbsr','ctc','puri',np.nan,'jajpur']})
df

    roll    name   age    city
0  101.0  sachin  20.0    bbsr
1    NaN  saurav  21.0     ctc
2  105.0     NaN   NaN    puri
3    NaN   dines   NaN     NaN
4  108.0     NaN  30.0  jajpur

In [14]:
# fill all the nan values by 0
df.fillna('0')

    roll    name   age    city
0  101.0  sachin  20.0    bbsr
1      0  saurav  21.0     ctc
2  105.0       0     0    puri
3      0   dines     0       0
4  108.0       0  30.0  jajpur

In [16]:
# fill the nan values of name column by "dhoni" and age column by 25
df.fillna({'name':'dhoni','age':25})

    roll    name   age    city
0  101.0  sachin  20.0    bbsr
1    NaN  saurav  21.0     ctc
2  105.0   dhoni  25.0    puri
3    NaN   dines  25.0     NaN
4  108.0   dhoni  30.0  jajpur

In [ ]:
method -- ffill/pad ---. fills the value  by it's previous value
backfill.bfill ---. fill the value by next value

In [17]:
df.fillna(method='ffill')

    roll    name   age    city
0  101.0  sachin  20.0    bbsr
1  101.0  saurav  21.0     ctc
2  105.0  saurav  21.0    puri
3  105.0   dines  21.0    puri
4  108.0   dines  30.0  jajpur

In [18]:
df.fillna(method='bfill')

    roll    name   age    city
0  101.0  sachin  20.0    bbsr
1  105.0  saurav  21.0     ctc
2  105.0   dines  30.0    puri
3  108.0   dines  30.0  jajpur
4  108.0     NaN  30.0  jajpur

In [19]:
df.fillna(method='ffill',axis=1)

    roll    name    age    city
0  101.0  sachin   20.0    bbsr
1    NaN  saurav   21.0     ctc
2  105.0   105.0  105.0    puri
3    NaN   dines  dines   dines
4  108.0   108.0   30.0  jajpur

In [20]:
# Limit=n fill n no of nan values in each column
df.fillna("0000",limit=1)

    roll    name   age    city
0  101.0  sachin  20.0    bbsr
1   0000  saurav  21.0     ctc
2  105.0    0000  0000    puri
3    NaN   dines   NaN    0000
4  108.0     NaN  30.0  jajpur

In [ ]:
 replace "sachin" by " dhoni"

In [21]:
df.replace(np.nan,"##")

    roll    name   age    city
0  101.0  sachin  20.0    bbsr
1     ##  saurav  21.0     ctc
2  105.0      ##    ##    puri
3     ##   dines    ##      ##
4  108.0      ##  30.0  jajpur

In [22]:
# replace nan values in age column to ##
df.replace({'age':np.nan},"##")

    roll    name   age    city
0  101.0  sachin  20.0    bbsr
1    NaN  saurav  21.0     ctc
2  105.0     NaN    ##    puri
3    NaN   dines    ##     NaN
4  108.0     NaN  30.0  jajpur

In [23]:
# replace all the string values to'AAAA'
df.replace('[A-Z a-z]','1',regex=True)

    roll    name   age    city
0  101.0  111111  20.0    1111
1    NaN  111111  21.0     111
2  105.0     NaN   NaN    1111
3    NaN   11111   NaN     NaN
4  108.0     NaN  30.0  111111

In [24]:
# convert a DataFrame to numpy array
arr=df.values
arr

array([[101.0, 'sachin', 20.0, 'bbsr'],
       [nan, 'saurav', 21.0, 'ctc'],
       [105.0, nan, nan, 'puri'],
       [nan, 'dines', nan, nan],
       [108.0, nan, 30.0, 'jajpur']], dtype=object)

In [25]:
type(arr)

numpy.ndarray

In [26]:
type(df)

pandas.core.frame.DataFrame

In [27]:
# convert a  numpy array to DataFrame
import pandas as pd
pd.DataFrame(arr,columns=['a','b','c','d'])

       a       b     c       d
0  101.0  sachin  20.0    bbsr
1    NaN  saurav  21.0     ctc
2  105.0     NaN   NaN    puri
3    NaN   dines   NaN     NaN
4  108.0     NaN  30.0  jajpur

In [ ]:
# loc and iloc
loc  ---- access elements label wise
iloc ---- access element index wise

In [2]:
import pandas as pd
import numpy as np
df=pd.DataFrame({'roll':[101,105,106,107,108],
                 'name':['sachin','saurav','rahul','dines','hardik'],
                 'age':[20,21,23,25,30],
                'city':['bbsr','ctc','puri','pune','jajpur']})
df

   roll    name  age    city
0   101  sachin   20    bbsr
1   105  saurav   21     ctc
2   106   rahul   23    puri
3   107   dines   25    pune
4   108  hardik   30  jajpur

In [3]:
df.loc[[0]]

   roll    name  age  city
0   101  sachin   20  bbsr

In [4]:
df.loc[[0,2]]

   roll    name  age  city
0   101  sachin   20  bbsr
2   106   rahul   23  puri

In [5]:
# display the names of 1st and 3rd person
df.loc[[0,2],'name']

0    sachin
2     rahul
Name: name, dtype: object

In [7]:
# display the names and age  of 1st and 3rd person
df.loc[[0,2],['name','age']]

     name  age
0  sachin   20
2   rahul   23

In [8]:
# display the names in reverse order
df.loc[::-1,['name']]

     name
4  hardik
3   dines
2   rahul
1  saurav
0  sachin

In [9]:
# display the names in reverse order
df.loc[::-1,['name','age']]

     name  age
4  hardik   30
3   dines   25
2   rahul   23
1  saurav   21
0  sachin   20

In [12]:
# display the names of who are of age greater than 25
df.loc[df['age']>22]

   roll    name  age    city
2   106   rahul   23    puri
3   107   dines   25    pune
4   108  hardik   30  jajpur

In [13]:
df.loc[[False,False,False,True,True]]

   roll    name  age    city
3   107   dines   25    pune
4   108  hardik   30  jajpur

In [16]:
#display the name and age of person where the age <25
df.loc[df['age']<25,['name','age']]

     name  age
0  sachin   20
1  saurav   21
2   rahul   23

In [17]:
# display the maximum value of age
df['age'].max()

30

In [21]:
#display the data of person of max age
df.loc[df['age']==df['age'].max()]

   roll    name  age    city
4   108  hardik   30  jajpur

In [22]:
df.iloc[0]

roll       101
name    sachin
age         20
city      bbsr
Name: 0, dtype: object

In [23]:
df.iloc[0,2]

20

In [24]:
df.iloc[::-1]

   roll    name  age    city
4   108  hardik   30  jajpur
3   107   dines   25    pune
2   106   rahul   23    puri
1   105  saurav   21     ctc
0   101  sachin   20    bbsr

df.iloc[row slicing,column slicing]

In [26]:
x=df.iloc[0:,0:3]
x

   roll    name  age
0   101  sachin   20
1   105  saurav   21
2   106   rahul   23
3   107   dines   25
4   108  hardik   30

In [31]:
y=df.iloc[0:,3:]
y

     city
0    bbsr
1     ctc
2    puri
3    pune
4  jajpur

In [32]:
df.to_csv("C:\\Users\\Sweta\\Desktop\\python\\Data Science\\new.csv")

In [33]:
df

   roll    name  age    city
0   101  sachin   20    bbsr
1   105  saurav   21     ctc
2   106   rahul   23    puri
3   107   dines   25    pune
4   108  hardik   30  jajpur

In [35]:
import pandas as pd
h=pd.read_csv("C:\\Users\\Sweta\\Desktop\\python\\Data Science\\new.csv")
h

   Unnamed: 0  roll    name  age    city
0           0   101  sachin   20    bbsr
1           1   105  saurav   21     ctc
2           2   106   rahul   23    puri
3           3   107   dines   25    pune
4           4   108  hardik   30  jajpur

In [37]:
# how to remove the un named column
df.drop(columns=['Unnamed : 0'])

KeyError: "['Unnamed : 0'] not found in axis"

In [40]:
df.to_csv("C:\\Users\\Sweta\\Desktop\\python\\Data Science\\new1.csv",index=False)
df1=pd.read_csv("C:\\Users\\Sweta\\Desktop\\python\\Data Science\\new1.csv")
df1

   roll    name  age    city
0   101  sachin   20    bbsr
1   105  saurav   21     ctc
2   106   rahul   23    puri
3   107   dines   25    pune
4   108  hardik   30  jajpur

In [45]:
import pandas as pd
import numpy as np
df=pd.DataFrame({'roll':[101,105,106,107,108],
                 'name':['sachin','saurav','rahul','dines','hardik'],
                 'age':[20,21,23,25,30],
                'city':['bbsr','ctc','puri','pune','jajpur']})
df

   roll    name  age    city
0   101  sachin   20    bbsr
1   105  saurav   21     ctc
2   106   rahul   23    puri
3   107   dines   25    pune
4   108  hardik   30  jajpur

In [48]:

df.to_excel("C:\\Users\\Sweta\\Desktop\\python\\Data Science\\new2.xlsx",index=False)

ModuleNotFoundError: No module named 'openpyxl'

In [ ]:
#how to convert a data frame to sql lite database
#1.crete dataframe
#2.create database 
#3.send datafrae to database
import pandas as pd
import numpy as np
df=pd.DataFrame({'roll':[101,105,106,107,108],
                 'name':['sachin','saurav','rahul','dines','hardik'],
                 'age':[20,21,23,25,30],
                'city':['bbsr','ctc','puri','pune','jajpur']})
df

In [49]:
import sqlite3 as s
con=s.connect("C:\\Users\\Sweta\\Desktop\\python\\Data Science\\sample.db")

In [50]:
df.to_sql(name='st',con=con,if_exists='replace',index=False)

5

In [52]:
pd.read_sql("select * from st",con=con)

   roll    name  age    city
0   101  sachin   20    bbsr
1   105  saurav   21     ctc
2   106   rahul   23    puri
3   107   dines   25    pune
4   108  hardik   30  jajpur

In [ ]:
interpolate --->

In [6]:
import pandas as pd
import numpy as np
df=pd.DataFrame({'roll':[101,105,106,107,108],
                 'name':['sachin','saurav',np.nan,'dines','hardik'],
                 'age':[23,np.nan,27,np.nan,30],
                'city':['bbsr','ctc','puri','pune','jajpur']})
df

   roll    name   age    city
0   101  sachin  23.0    bbsr
1   105  saurav   NaN     ctc
2   106     NaN  27.0    puri
3   107   dines   NaN    pune
4   108  hardik  30.0  jajpur

In [7]:
df.interpolate()

   roll    name   age    city
0   101  sachin  23.0    bbsr
1   105  saurav  25.0     ctc
2   106     NaN  27.0    puri
3   107   dines  28.5    pune
4   108  hardik  30.0  jajpur

In [9]:
df.interpolate(method="linear",limit_direction="forward")

   roll    name   age    city
0   101  sachin  23.0    bbsr
1   105  saurav  25.0     ctc
2   106     NaN  27.0    puri
3   107   dines  28.5    pune
4   108  hardik  30.0  jajpur

In [10]:
df.interpolate(method="linear",limit_direction="backward")

   roll    name   age    city
0   101  sachin  23.0    bbsr
1   105  saurav  25.0     ctc
2   106     NaN  27.0    puri
3   107   dines  28.5    pune
4   108  hardik  30.0  jajpur

In [ ]:
# interpolate can handle columns with numeric values

In [11]:
import numpy as np
import pandas as pd
df=pd.DataFrame({'Date':['10-07-2022','14-07-2022','16-07-2022','17-07-2022','20-07-2022'],
                 'roll':[101,np.nan,105,np.nan,109],
                'name':['sachin','saurav',np.nan,np.nan,'dhoni'],
                'age':[23,np.nan,27,np.nan,30]})
df

         Date   roll    name   age
0  10-07-2022  101.0  sachin  23.0
1  14-07-2022    NaN  saurav   NaN
2  16-07-2022  105.0     NaN  27.0
3  17-07-2022    NaN     NaN   NaN
4  20-07-2022  109.0   dhoni  30.0

In [12]:
# fill the nan values according to date and time
df.interpolate(method='time')
# here the date column values are string not date time

ValueError: time-weighted interpolation only works on Series or DataFrames with a DatetimeIndex

In [ ]:
convert this dataframe into a csv file

In [18]:
df.to_csv("C:\\Users\\Sweta\\Desktop\\python\\Data Science\\sample1.csv",index=False)

In [19]:
df1=pd.read_csv("C:\\Users\\Sweta\\Desktop\\python\\Data Science\\sample1.csv",parse_dates=['Date'],index_col='Date')
df1

             roll    name   age
Date
10-07-2022  101.0  sachin  23.0
14-07-2022    NaN  saurav   NaN
16-07-2022  105.0     NaN  27.0
17-07-2022    NaN     NaN   NaN
20-07-2022  109.0   dhoni  30.0

In [20]:
df1.interpolate(method='time')

ValueError: time-weighted interpolation only works on Series or DataFrames with a DatetimeIndex

In [21]:
import pandas as pd
import numpy as np
df=pd.DataFrame({'roll':[101,np.nan,105,np.nan,109],
                'name':['sachin','saurav',np.nan,np.nan,'dhoni'],
                 'age':[23,np.nan,27,np.nan,30],
                'mark':[70,50,np.nan,80,np.nan],
                'result':['pass','pass','fail','pass','fail']})
df

    roll    name   age  mark result
0  101.0  sachin  23.0  70.0   pass
1    NaN  saurav   NaN  50.0   pass
2  105.0     NaN  27.0   NaN   fail
3    NaN     NaN   NaN  80.0   pass
4  109.0   dhoni  30.0   NaN   fail

In [ ]:
####################################################################
#Q-1 display the no of missing values in each column????
#Q2 --- Repalece  the missing values  as True and non missing values as False
#q -3  reverse  q-2
# Q--4  identify  the columns  having atleast  one missing value??
#5 #  display  names of columns with all values as nan
# Q-6 remove  the rows  with all nan values
# 7 drop those columns with atleast one nan 
##Q-8--  drop the rows  wheare  "name"  value is Nan
# Q=9 display  total  nan values  in  data frame
#Q-10 ---replace  the nan values  from  its  previous values
##11  display  the student  names whose age>=25

In [44]:
#Q-1 display the no of missing values in each column????
df.isna().sum()

roll      2
name      2
age       2
mark      2
result    0
dtype: int64

In [22]:
#Q2 --- Repalece  the missing values  as True and non missing values as False
df.isnull()

    roll   name    age   mark  result
0  False  False  False  False   False
1   True  False   True  False   False
2  False   True  False   True   False
3   True   True   True  False   False
4  False  False  False   True   False

In [45]:
# Q--4  identify  the columns  having atleast  one missing value??
df.isnull().any()

roll       True
name       True
age        True
mark       True
result    False
dtype: bool

In [46]:
#5 #  display  names of columns with all values as nan
df.isnull().all()

roll      False
name      False
age       False
mark      False
result    False
dtype: bool

In [24]:
#Q-1 display the no of missing values in each column????
df['roll'].isna().sum()

2

In [25]:
df['name'].isna().sum()

2

In [26]:
df['age'].isna().sum()

2

In [27]:
df['mark'].isna().sum()

2

In [28]:
df['result'].isna().sum()

0

In [ ]:
df.fillna('False')

In [29]:
#q -3  reverse  q-2
df.notnull()

    roll   name    age   mark  result
0   True   True   True   True    True
1  False   True  False   True    True
2   True  False   True  False    True
3  False  False  False   True    True
4   True   True   True  False    True

In [34]:
df.dropna(axis=0,how='all')
df['mark']. isna(). values. any()

True

In [35]:
df.isna().any()

roll       True
name       True
age        True
mark       True
result    False
dtype: bool

In [36]:
# Q-6 remove  the rows  with all nan values
df.dropna(axis=0,how='all')

    roll    name   age  mark result
0  101.0  sachin  23.0  70.0   pass
1    NaN  saurav   NaN  50.0   pass
2  105.0     NaN  27.0   NaN   fail
3    NaN     NaN   NaN  80.0   pass
4  109.0   dhoni  30.0   NaN   fail

In [37]:
# 7 drop those columns with atleast one nan
df.dropna(axis=1,how='any')

  result
0   pass
1   pass
2   fail
3   pass
4   fail

In [48]:
##Q-8--  drop the rows  wheare  "name"  value is Nan
df.dropna(subset='name')

    roll    name   age  mark result
0  101.0  sachin  23.0  70.0   pass
1    NaN  saurav   NaN  50.0   pass
4  109.0   dhoni  30.0   NaN   fail

In [47]:
# Q=9 display  total  nan values  in  data frame
df.isnull().sum().sum()

8

In [39]:
#Q-10 ---replace  the nan values  from  its  previous values
df.fillna(method='bfill')

    roll    name   age  mark result
0  101.0  sachin  23.0  70.0   pass
1  105.0  saurav  27.0  50.0   pass
2  105.0   dhoni  27.0  80.0   fail
3  109.0   dhoni  30.0  80.0   pass
4  109.0   dhoni  30.0   NaN   fail

In [41]:
##11  display  the student  names whose age>=25
df.loc[df['age']>25,['name']]

    name
2    NaN
4  dhoni

In [50]:
# wap to display the data of students where age>25 and result is pass
df.loc[(df['age']>25) & (df['result']=='pass')]

Empty DataFrame
Columns: [roll, name, age, mark, result]
Index: []